---
kind: method
id: M:Autodesk.Revit.DB.AssemblyInstance.GetTransform
source: html/e369679d-a16e-ef8a-76fe-e69922540c73.htm
---
# Autodesk.Revit.DB.AssemblyInstance.GetTransform Method

Gets the origin of the assembly instance.

## Syntax (C#)
```csharp
public Transform GetTransform()
```

## Returns
The origin of the assembly instance.